# frozen_string_literal: true

class Writer
  def initialize
    @columns = [:name]
    @category = [
      ['Жанр Боевики'],
      ['Жанр Военные'],
      ['Жанр Детективы'],
      ['Жанр Детская проза'],
      ['Жанр Домашняя'],
      ['Жанр Драма'],
      ['Жанр Историческая проза'],
      ['Жанр Классика'],
      ['Жанр Медицина'],
      ['Жанр Научная фантастика'],
      ['Жанр Политика'],
      ['Жанр Приключение'],
      ['Жанр Психология'],
      ['Жанр Романы'],
      ['Жанр Сказки'],
      ['Жанр Современная проза'],
      ['Жанр Триллеры'],
      ['Жанр Ужасы и мистика'],
      ['Жанр Фэнтези'],
      ['Жанр Эротика'],
      ['Жанр Юмористическая проза']
    ]
  end

  def write_base
    Category.import @columns, @category
  end
end
